[
  {
    "id": "2510.24567v1",
    "title": "Phase-Space Shaping in Wakefield Accelerators due to Betatron Cooling",
    "abstract": "Plasma-based accelerators are beginning to employ relativistic beams with unprecedented charge and ultrashort durations. These dense driver beams can drive wakes even in high-density plasmas ($\\gtrsim10^{19}$ cm$^{-3}$), where betatron radiation becomes increasingly important and begins to affect the dynamics of the accelerated beam. In this Letter, we show that betatron cooling leads to a strong, structuring of the phase space of the beam. This gives rise to bunched, ring-like structures with positive radial position and momentum gradients, \\emph{i.e.}, population inversion of the amplitude of oscillation. We derive the characteristic timescales for this process analytically and confirm our predictions with multi-dimensional Particle-in-Cell simulations. The radiation-dominated regime of beam dynamics fundamentally alters the acceleration process and produces self-structured beams capable of triggering coherent betatron emission in ion channels.",
    "authors": [
      "Pablo J. Bilbao",
      "Thales Silva",
      "Luis O. Silva"
    ],
    "published": "2025-10-28T15:58:10+00:00",
    "pdf_url": "http://arxiv.org/pdf/2510.24567v1",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "collected_at": "2025-10-29T19:46:29.196993"
  },
  {
    "id": "2510.24347v1",
    "title": "Physics-Informed Visual MARFE Prediction on the HL-3 Tokamak",
    "abstract": "The Multifaceted Asymmetric Radiation From the Edge (MARFE) is a critical plasma instability that often precedes density-limit disruptions in tokamaks, posing a significant risk to machine integrity and operational efficiency. Early and reliable alert of MARFE formation is therefore essential for developing effective disruption mitigation strategies, particularly for next-generation devices like ITER. This paper presents a novel, physics-informed indicator for early MARFE prediction and disruption warning developed for the HL-3 tokamak. Our framework integrates two core innovations: (1) a high-fidelity label refinement pipeline that employs a physics-scored, weighted Expectation-Maximization (EM) algorithm to systematically correct noise and artifacts in raw visual data from cameras, and (2) a continuous-time, physics-constrained Neural Ordinary Differential Equation (Neural ODE) model that predicts the short-horizon ``worsening\" of a MARFE. By conditioning the model's dynamics on key plasma parameters such as normalized density ($f_G$, derived from core electron density) and core electron temperature ($T_e$), the predictor achieves superior performance in the low-false-alarm regime crucial for control. On a large experimental dataset from HL-3, our model demonstrates high predictive accuracy, achieving an Area Under the Curve (AUC) of 0.969 for 40ms-ahead prediction. The indicator has been successfully deployed for real-time operation with updates every 1 ms. This work lays a very foundation for future proactive MARFE mitigation.",
    "authors": [
      "Qianyun Dong",
      "Rongpeng Li",
      "Zongyu Yang",
      "Fan Xia",
      "Liang Liu",
      "Zhifeng Zhao",
      "Wulyu Zhong"
    ],
    "published": "2025-10-28T12:11:26+00:00",
    "pdf_url": "http://arxiv.org/pdf/2510.24347v1",
    "categories": [
      "physics.plasm-ph"
    ],
    "collected_at": "2025-10-29T19:46:29.702514"
  },
  {
    "id": "2510.24121v1",
    "title": "Effect of flow-aligned external magnetic fields on mushroom instability",
    "abstract": "Mushroom instability (MI) is a shear instability considered responsible for generating and amplifying magnetic fields in relativistic jets. While astrophysical jets are usually considered to be magnetized, how MI acts in magnetized jets remains poorly understood. In this paper, we investigate the effect of a flow-aligned external magnetic field on MI, with both theoretical analyses and particle-in-cell (PIC) simulations. In the limit of a cold and collisionless plasma, we derive a generalized dispersion relation for linear growth rates of the magnetized MIs. Numerical solutions of the dispersion relation reveal that the external magnetic field always suppresses the growth of MI, though MIs are much more robust to the external magnetic field than electron-scale Kelvin-Helmholtz instabilities (ESKHIs). Analyses are also extended to instabilities with an arbitrary wavevector in the shear interface plane. Two-dimensional PIC simulations of single-mode MIs reach a good agreement with our analytical predictions. In simulations with finite temperatures, we observe the competition and cooperation between MIs and a diffusion-induced DC magnetic field.",
    "authors": [
      "Y. Guo",
      "D. Wu",
      "J. Zhang"
    ],
    "published": "2025-10-28T06:47:49+00:00",
    "pdf_url": "http://arxiv.org/pdf/2510.24121v1",
    "categories": [
      "physics.plasm-ph"
    ],
    "collected_at": "2025-10-29T19:46:30.207500"
  },
  {
    "id": "2510.23690v1",
    "title": "Quantum Kinetic Modeling of KEEN waves in a Warm-Dense Regime",
    "abstract": "We report a fully kinetic, quantum study of Kinetic Electrostatic Electron Nonlinear (KEEN) waves, showing that quantum diffraction systematically erodes the classical trapping mechanism, narrow harmonic locking to the fundamental, and hasten post-drive decay. Electrons are evolved with a second-order Strang-split 1D1V Wigner-Poisson solver that couples conservative semi-Lagrangian WENO advection to an analytic Fourier space update for the non-local Wigner term, while ions remain classical. Short, frequency-tuned ponderomotive pulses drive KEEN formation in a uniform Maxwellian plasma; as the dimensionless quantum parameter H rises from the classical limit to values relevant to warm-dense matter, doped semiconductors, and 2D electron systems, the drive threshold increases, higher harmonics are damped, trapped electron vortices diffuse, and the subplasma electrostatic energy relaxes to a lower stationary level, as confirmed by continuous wavelet analysis. These microscopic changes carry macroscopic weight. Ignition-scale capsules now compress matter to regimes where the electron de Broglie wavelength rivals the Debye length, making classical kinetic descriptions insufficient. By extending KEEN physics into this quantum domain, our results offer a potential diagnostic of nonequilibrium electron dynamics for next-generation inertial-confinement designs and high-energy-density platforms, indicating that predictive fusion modeling may benefit from the integration of kinetic fidelity with quantum effects.",
    "authors": [
      "F. Alejandro Padilla-Gomez",
      "Sining Gong",
      "Michael S. Murillo",
      "F. R. Graziani",
      "Andrew J. Christlieb"
    ],
    "published": "2025-10-27T17:34:42+00:00",
    "pdf_url": "http://arxiv.org/pdf/2510.23690v1",
    "categories": [
      "physics.plasm-ph"
    ],
    "collected_at": "2025-10-29T19:46:30.710423"
  },
  {
    "id": "2510.23562v1",
    "title": "Design of Backscatter Tailored Optical Fibers for distributed magnetic field sensing using Fiber Optic Pulsed Polarimetry",
    "abstract": "Fiber optic pulsed polarimetry is a LIDAR-like fiber sensing technique that uses a backscatter enhanced single mode backscatter-tailored optical fiber(BTOF) to measure the distributed B fields on all Magnetic Fusion Energy devices. The BTOF has a series of wavelength resonant reflection fiber Bragg gratings written uniformly along its length. The fiber's Verdet constant determines the strength of the Faraday effect which effectuates the measurement of local B along the fiber placed intimately next to or within a magnetized plasma volume. A robust measurement of the field distribution along the fiber is obtained at high rep rates, 5 MHz, high spatial resolution(1-10cm), high B field accuracy(<1%) and temporal response (ns). Multipathing in the BTOF produces 3rd order reflections that contaminate the LIDAR signal. Algorithms are given for calculating the level of contamination for uniform and flat reflection designs, in particular and any reflection series in general. The contamination is bracketed giving confidence in designing and implementing a BTOF. Applications include magnetic fusion devices, rail guns, high temperature superconducting magnets and magnetized target fusion research.",
    "authors": [
      "Roger J Smith"
    ],
    "published": "2025-10-27T17:33:05+00:00",
    "pdf_url": "http://arxiv.org/pdf/2510.23562v1",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "collected_at": "2025-10-29T19:46:31.214575"
  }
]